virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27_DFP/component/tdes.h
/* -------- TDES_IVR : (TDES Offset: 0x60) ( /W 32) Initialization Vector Register -------- */
#define TDES_IVR_IV_Pos                       _U_(0)                                               /**< (TDES_IVR) Initialization Vector Position */
#define TDES_IVR_IV_Msk                       (_U_(0xFFFFFFFF) << TDES_IVR_IV_Pos)                 /**< (TDES_IVR) Initialization Vector Mask */
#define TDES_IVR_IV(value)                    (TDES_IVR_IV_Msk & ((value) << TDES_IVR_IV_Pos))    
#define TDES_IVR_Msk                          _U_(0xFFFFFFFF)                                      /**< (TDES_IVR) Register Mask  */


/* -------- TDES_XTEA_RNDR : (TDES Offset: 0x70) (R/W 32) XTEA Rounds Register -------- */
#define TDES_XTEA_RNDR_XTEA_RNDS_Pos          _U_(0)                                               /**< (TDES_XTEA_RNDR) Number of Rounds Position */
#define TDES_XTEA_RNDR_XTEA_RNDS_Msk          (_U_(0x3F) << TDES_XTEA_RNDR_XTEA_RNDS_Pos)          /**< (TDES_XTEA_RNDR) Number of Rounds Mask */
#define TDES_XTEA_RNDR_XTEA_RNDS(value)       (TDES_XTEA_RNDR_XTEA_RNDS_Msk & ((value) << TDES_XTEA_RNDR_XTEA_RNDS_Pos))
#define TDES_XTEA_RNDR_Msk                    _U_(0x0000003F)                                      /**< (TDES_XTEA_RNDR) Register Mask  */


/** \brief TDES register offsets definitions */
#define TDES_CR_REG_OFST               (0x00)              /**< (TDES_CR) Control Register Offset */
#define TDES_MR_REG_OFST               (0x04)              /**< (TDES_MR) Mode Register Offset */
#define TDES_IER_REG_OFST              (0x10)              /**< (TDES_IER) Interrupt Enable Register Offset */
#define TDES_IDR_REG_OFST              (0x14)              /**< (TDES_IDR) Interrupt Disable Register Offset */
#define TDES_IMR_REG_OFST              (0x18)              /**< (TDES_IMR) Interrupt Mask Register Offset */
#define TDES_ISR_REG_OFST              (0x1C)              /**< (TDES_ISR) Interrupt Status Register Offset */
#define TDES_KEY1WR_REG_OFST           (0x20)              /**< (TDES_KEY1WR) Key 1 Word Register Offset */
#define TDES_KEY1WR0_REG_OFST          (0x20)              /**< (TDES_KEY1WR0) Key 1 Word Register Offset */
#define TDES_KEY1WR1_REG_OFST          (0x24)              /**< (TDES_KEY1WR1) Key 1 Word Register Offset */
#define TDES_KEY2WR_REG_OFST           (0x28)              /**< (TDES_KEY2WR) Key 2 Word Register Offset */
#define TDES_KEY2WR0_REG_OFST          (0x28)              /**< (TDES_KEY2WR0) Key 2 Word Register Offset */
#define TDES_KEY2WR1_REG_OFST          (0x2C)              /**< (TDES_KEY2WR1) Key 2 Word Register Offset */
#define TDES_KEY3WR_REG_OFST           (0x30)              /**< (TDES_KEY3WR) Key 3 Word Register Offset */
#define TDES_KEY3WR0_REG_OFST          (0x30)              /**< (TDES_KEY3WR0) Key 3 Word Register Offset */
#define TDES_KEY3WR1_REG_OFST          (0x34)              /**< (TDES_KEY3WR1) Key 3 Word Register Offset */
#define TDES_IDATAR_REG_OFST           (0x40)              /**< (TDES_IDATAR) Input Data Register Offset */
#define TDES_IDATAR0_REG_OFST          (0x40)              /**< (TDES_IDATAR0) Input Data Register Offset */
#define TDES_IDATAR1_REG_OFST          (0x44)              /**< (TDES_IDATAR1) Input Data Register Offset */
#define TDES_ODATAR_REG_OFST           (0x50)              /**< (TDES_ODATAR) Output Data Register Offset */
#define TDES_ODATAR0_REG_OFST          (0x50)              /**< (TDES_ODATAR0) Output Data Register Offset */
#define TDES_ODATAR1_REG_OFST          (0x54)              /**< (TDES_ODATAR1) Output Data Register Offset */
#define TDES_IVR_REG_OFST              (0x60)              /**< (TDES_IVR) Initialization Vector Register Offset */
#define TDES_IVR0_REG_OFST             (0x60)              /**< (TDES_IVR0) Initialization Vector Register Offset */
#define TDES_IVR1_REG_OFST             (0x64)              /**< (TDES_IVR1) Initialization Vector Register Offset */
#define TDES_XTEA_RNDR_REG_OFST        (0x70)              /**< (TDES_XTEA_RNDR) XTEA Rounds Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief TDES register API structure */
typedef struct
{
  __O   uint32_t                       TDES_CR;            /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       TDES_MR;            /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   uint8_t                        Reserved1[0x08];
  __O   uint32_t                       TDES_IER;           /**< Offset: 0x10 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       TDES_IDR;           /**< Offset: 0x14 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       TDES_IMR;           /**< Offset: 0x18 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       TDES_ISR;           /**< Offset: 0x1C (R/   32) Interrupt Status Register */
  __O   uint32_t                       TDES_KEY1WR[2];     /**< Offset: 0x20 ( /W  32) Key 1 Word Register */
  __O   uint32_t                       TDES_KEY2WR[2];     /**< Offset: 0x28 ( /W  32) Key 2 Word Register */
  __O   uint32_t                       TDES_KEY3WR[2];     /**< Offset: 0x30 ( /W  32) Key 3 Word Register */
  __I   uint8_t                        Reserved2[0x08];
  __O   uint32_t                       TDES_IDATAR[2];     /**< Offset: 0x40 ( /W  32) Input Data Register */
  __I   uint8_t                        Reserved3[0x08];
  __I   uint32_t                       TDES_ODATAR[2];     /**< Offset: 0x50 (R/   32) Output Data Register */
  __I   uint8_t                        Reserved4[0x08];
  __O   uint32_t                       TDES_IVR[2];        /**< Offset: 0x60 ( /W  32) Initialization Vector Register */
  __I   uint8_t                        Reserved5[0x08];
  __IO  uint32_t                       TDES_XTEA_RNDR;     /**< Offset: 0x70 (R/W  32) XTEA Rounds Register */
} tdes_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_TDES_COMPONENT_H_ */
